Minute Changes made
